IHateThisProject11/WincTest/winc1500/bsp/source/nm_bsp_stm32h5.c

/**
 *
 * \file
 *
 * \brief This module contains SAMD21 BSP APIs implementation.
 *
 * Copyright (c) 2016-2017 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#include "bsp/include/nm_bsp.h"
#include "common/include/nm_common.h"
#include "stm32h5xx_hal.h"
//#include "cmsis_os.h"
#include "conf_winc.h"


static tpfNmBspIsr gpfIsr;   /* lives only in this file */


/*
 *	@fn		init_chip_pins
 *	@brief	Initialize reset, chip enable and wake pin
 */
static void init_chip_pins(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* ---- RESET (active low) ---- */
    GPIO_InitStruct.Pin   = RESET_WINC_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(RESET_WINC_GPIO_Port, &GPIO_InitStruct);
    HAL_GPIO_WritePin(RESET_WINC_GPIO_Port, RESET_WINC_Pin, GPIO_PIN_RESET);

    /* ---- CHIP ENABLE ---- */
    GPIO_InitStruct.Pin = CHIP_EN_WINC_Pin;
    /* same Mode/Pull/Speed as above */
    HAL_GPIO_Init(CHIP_EN_WINC_GPIO_Port, &GPIO_InitStruct);
    HAL_GPIO_WritePin(CHIP_EN_WINC_GPIO_Port, CHIP_EN_WINC_Pin, GPIO_PIN_RESET);

    /* perform a hardware reset pulse */
    HAL_Delay(50);
    HAL_GPIO_WritePin(CHIP_EN_WINC_GPIO_Port, CHIP_EN_WINC_Pin, GPIO_PIN_SET);
    HAL_Delay(50);
    HAL_GPIO_WritePin(RESET_WINC_GPIO_Port, RESET_WINC_Pin, GPIO_PIN_SET);
    HAL_Delay(1000);
}

/*
 *	@fn		nm_bsp_init
 *	@brief	Initialize BSP
 *	@return	0 in case of success and -1 in case of failure
 */
sint8 nm_bsp_init(void)
{
	/* Initialize chip IOs. */
	init_chip_pins();

	/* Perform chip reset. */
	nm_bsp_reset();

	return M2M_SUCCESS;
}

/**
 *	@fn		nm_bsp_deinit
 *	@brief	De-Initialize BSP
 *	@return	0 in case of success and -1 in case of failure
 */
sint8 nm_bsp_deinit(void)
{
    /* De-Initialize WiFi GPIO pins */
     /* Reset the chip enable and chip reset pins */
    HAL_GPIO_WritePin(GPIOA,CONF_WINC_PIN_POWER_ENABLE,GPIO_PIN_RESET);
    HAL_GPIO_WritePin(CONF_WINC_PORT_LEVEL_SHIFTER_ENABLE,CONF_WINC_PIN_LEVEL_SHIFTER_ENABLE,GPIO_PIN_SET);
    //HAL_GPIO_WritePin(GPIOA,CONF_WINC_PIN_CHIP_ENABLE,GPIO_PIN_RESET);
	
    HAL_GPIO_WritePin(CONF_WINC_CHIP_EN_PORT,CONF_WINC_PIN_CHIP_ENABLE,GPIO_PIN_RESET);
    HAL_GPIO_WritePin(CONF_WINC_RESET_PORT,CONF_WINC_PIN_RESET,GPIO_PIN_RESET);
    nm_bsp_sleep(10);

	return M2M_SUCCESS;
}

/**
 *	@fn		nm_bsp_reset
 *	@brief	Reset NMC1500 SoC by setting CHIP_EN and RESET_N signals low,
 *           CHIP_EN high then RESET_N high
// */
//void nm_bsp_reset(void)
//{
//    /* Set Power sequence of GPIO lines */
//    /* -------------------------------- */
//
//    /* Power enable (3.3V) - 3V3_DC2DC_EN output */
//    HAL_GPIO_WritePin(GPIOA,CONF_WINC_PIN_POWER_ENABLE,GPIO_PIN_SET);
//    HAL_Delay(100);
//
//    /* Level Shifter Translate enable - LEVEL_TRNSLT_EN output */
//    HAL_GPIO_WritePin(CONF_WINC_PORT_LEVEL_SHIFTER_ENABLE,CONF_WINC_PIN_LEVEL_SHIFTER_ENABLE,GPIO_PIN_RESET);
//    HAL_Delay(100);
//
//    /* Set CHIP enable */
//   // HAL_GPIO_WritePin(GPIOA,CONF_WINC_PIN_CHIP_ENABLE,GPIO_PIN_SET);
//    HAL_GPIO_WritePin(CONF_WINC_PORT_CHIP_ENABLE, CONF_WINC_PIN_CHIP_ENABLE, GPIO_PIN_SET);
//    HAL_Delay(100);
//
//    /* Set RSTN 1.8V */
//    HAL_GPIO_WritePin(CONF_WINC_PORT_RESET,        CONF_WINC_PIN_RESET,        GPIO_PIN_SET);
//    HAL_Delay(100);
//
//}
void nm_bsp_reset(void)
{
    /* Assert reset immediately after MCU startup */
    HAL_GPIO_WritePin(CONF_WINC_RESET_PORT,
                      CONF_WINC_RESET_PIN, GPIO_PIN_RESET);

    /* 10 ms > 8 ms spec; long enough even at cold temperature */
    HAL_Delay(10);

    /* Release reset – CHIP_EN is already high on your board */
    HAL_GPIO_WritePin(CONF_WINC_RESET_PORT,
                      CONF_WINC_RESET_PIN, GPIO_PIN_SET);

    /* Extra guard time before first SPI access */ //changed delay from 2 to 50 to try and winc BOOT ROM
    HAL_Delay(500);
}


/*
 *	@fn		nm_bsp_sleep
 *	@brief	Sleep in units of mSec
 *	@param[IN]	u32TimeMsec
 *				Time in milliseconds
 */
void nm_bsp_sleep(uint32 u32TimeMsec)
{
    /* use FreeRTOS delay */
	osDelay(u32TimeMsec);
}

/*
 *	@fn		nm_bsp_register_isr
 *	@brief	Register interrupt service routine
 *	@param[IN]	pfIsr
 *				Pointer to ISR handler
 */
void nm_bsp_register_isr(tpfNmBspIsr pfIsr)
{
    gpfIsr = pfIsr;
    /* CubeMX already configured PC4 as EXTI and enabled EXTI4_IRQn.
       Do NOT re-init the pin or change NVIC priority here. */



#if 0
	GPIO_InitTypeDef   GPIO_InitStructure;
	
	/* Enable GPIOC clock */
	__HAL_RCC_GPIOC_CLK_ENABLE();
	
	/* Configure PC.13 pin as input floating */
	GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Pin = GPIO_PIN_13;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	/* Enable and set EXTI line 15_10 Interrupt to the lowest priority */
	HAL_NVIC_SetPriority(EXTI15_10_IRQn, 2, 0);
	HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
#endif

}

void nm_bsp_call_isr(void)    /* lightweight trampoline */
{
    if (gpfIsr) gpfIsr();
}
/*
 *	@fn		nm_bsp_interrupt_ctrl
 *	@brief	Enable/Disable interrupts
 *	@param[IN]	u8Enable
 *				'0' disable interrupts. '1' enable interrupts
 */
void nm_bsp_interrupt_ctrl(uint8 u8Enable)
{
    if (u8Enable)
        HAL_NVIC_EnableIRQ((IRQn_Type)CONF_WINC_EXTI_IRQN);
    else
        HAL_NVIC_DisableIRQ((IRQn_Type)CONF_WINC_EXTI_IRQN);
}
